//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                    𝗠𝗔𝗡𝗨-𝗠𝗗  𝐁𝐎𝐓                                                 //
//                                                                                                      //
//                                         Ｖ：7.0                                                       //

//███╗░░░███╗░█████╗░███╗░░██╗██╗░░░██╗
//████╗░████║██╔══██╗████╗░██║██║░░░██║
//██╔████╔██║███████║██╔██╗██║██║░░░██║
//██║╚██╔╝██║██╔══██║██║╚████║██║░░░██║
//██║░╚═╝░██║██║░░██║██║░╚███║╚██████╔╝
//╚═╝░░░░░╚═╝╚═╝░░╚═╝╚═╝░░╚══╝░╚═════╝░

//███╗░░░███╗██████╗░
//████╗░████║██╔══██╗
//██╔████╔██║██║░░██║
//██║╚██╔╝██║██║░░██║
//██║░╚═╝░██║██████╔╝
//╚═╝░░░░░╚═╝╚═════╝░

//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//*
//  * @project_name : MANU-MD
//  * @author : Manul Official
//  * @youtube : https://www.youtube.com/@ManulOfficialTech
//  * @description : Manu-MD ,A Multi-functional whatsapp user bot.
//*
//*
//base by Manul Official
//GitHub: @manulofficial7
//WhatsApp: +94742274855
//want more free bot scripts? subscribe to my youtube channel: https://youtube.com/@ManulOfficialTech
//   * Created By Github: manulofficial7.
//   * Credit To Manul Official
//   * © 2024 MANU-MD-V7.
// ⛥┌┤
// */

function _0x190d(_0x26fbe9,_0x44ae48){var _0x3b20d6=_0x3b20();return _0x190d=function(_0x190d7c,_0x15f6bb){_0x190d7c=_0x190d7c-0x10f;var _0x543f86=_0x3b20d6[_0x190d7c];return _0x543f86;},_0x190d(_0x26fbe9,_0x44ae48);}var _0x47b086=_0x190d;function _0x3b20(){var _0x5f8f44=['\x31\x31\x34\x6c\x41\x7a\x45\x5a\x75','\x32\x30\x39\x30\x37\x35\x35\x37\x4f\x59\x61\x51\x7a\x47','\x35\x37\x39\x32\x37\x34\x35\x62\x47\x7a\x6f\x4b\x72','\x31\x37\x33\x30\x35\x32\x30\x44\x53\x53\x6f\x70\x4b','\x66\x72\x6f\x6d\x4d\x65','\x31\x30\x70\x71\x4e\x66\x74\x65','\x33\x74\x74\x69\x42\x57\x75','\x63\x61\x74\x65\x67\x6f\x72\x79','\x36\x38\x45\x5a\x6f\x45\x73\x4a','\x4e\x6f\x74\x20\x50\x72\x6f\x76\x69\x64\x65\x64','\x64\x6f\x6e\x74\x41\x64\x64\x43\x6f\x6d\x6d\x61\x6e\x64\x4c\x69\x73\x74','\x66\x69\x6c\x65\x6e\x61\x6d\x65','\x35\x31\x38\x35\x48\x6f\x66\x75\x70\x48','\x66\x75\x6e\x63\x74\x69\x6f\x6e','\x32\x37\x39\x32\x30\x35\x72\x57\x45\x4e\x46\x67','\x39\x35\x35\x38\x30\x34\x35\x57\x41\x44\x56\x7a\x58','\x33\x38\x33\x31\x30\x38\x62\x71\x64\x79\x7a\x69','\x65\x78\x70\x6f\x72\x74\x73','\x64\x65\x73\x63'];_0x3b20=function(){return _0x5f8f44;};return _0x3b20();}(function(_0x507801,_0x79744e){var _0x32f373=_0x190d,_0x4fc249=_0x507801();while(!![]){try{var _0xf511c2=parseInt(_0x32f373(0x112))/0x1*(-parseInt(_0x32f373(0x121))/0x2)+parseInt(_0x32f373(0x11f))/0x3*(-parseInt(_0x32f373(0x116))/0x4)+parseInt(_0x32f373(0x114))/0x5*(-parseInt(_0x32f373(0x119))/0x6)+-parseInt(_0x32f373(0x11b))/0x7+-parseInt(_0x32f373(0x11c))/0x8+parseInt(_0x32f373(0x115))/0x9+parseInt(_0x32f373(0x11e))/0xa*(parseInt(_0x32f373(0x11a))/0xb);if(_0xf511c2===_0x79744e)break;else _0x4fc249['push'](_0x4fc249['shift']());}catch(_0x1ad951){_0x4fc249['push'](_0x4fc249['shift']());}}}(_0x3b20,0x8f044));var commands=[];function cmd(_0x1a6629,_0x4e7339){var _0x3c6bc0=_0x190d,_0x39d966=_0x1a6629;_0x39d966[_0x3c6bc0(0x113)]=_0x4e7339;if(!_0x39d966[_0x3c6bc0(0x110)])_0x39d966[_0x3c6bc0(0x110)]=![];if(!_0x1a6629[_0x3c6bc0(0x118)])_0x1a6629[_0x3c6bc0(0x118)]='';if(!_0x39d966[_0x3c6bc0(0x11d)])_0x39d966['\x66\x72\x6f\x6d\x4d\x65']=![];if(!_0x1a6629[_0x3c6bc0(0x120)])_0x39d966['\x63\x61\x74\x65\x67\x6f\x72\x79']='\x6d\x69\x73\x63';if(!_0x1a6629[_0x3c6bc0(0x111)])_0x39d966[_0x3c6bc0(0x111)]=_0x3c6bc0(0x10f);return commands['\x70\x75\x73\x68'](_0x39d966),_0x39d966;}module[_0x47b086(0x117)]={'\x63\x6d\x64':cmd,'\x41\x64\x64\x43\x6f\x6d\x6d\x61\x6e\x64':cmd,'\x46\x75\x6e\x63\x74\x69\x6f\x6e':cmd,'\x4d\x6f\x64\x75\x6c\x65':cmd,'\x63\x6f\x6d\x6d\x61\x6e\x64\x73':commands};