//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                    𝗠𝗔𝗡𝗨-𝗠𝗗  𝐁𝐎𝐓                                                 //
//                                                                                                      //
//                                         Ｖ：7.0                                                       //

//███╗░░░███╗░█████╗░███╗░░██╗██╗░░░██╗
//████╗░████║██╔══██╗████╗░██║██║░░░██║
//██╔████╔██║███████║██╔██╗██║██║░░░██║
//██║╚██╔╝██║██╔══██║██║╚████║██║░░░██║
//██║░╚═╝░██║██║░░██║██║░╚███║╚██████╔╝
//╚═╝░░░░░╚═╝╚═╝░░╚═╝╚═╝░░╚══╝░╚═════╝░

//███╗░░░███╗██████╗░
//████╗░████║██╔══██╗
//██╔████╔██║██║░░██║
//██║╚██╔╝██║██║░░██║
//██║░╚═╝░██║██████╔╝
//╚═╝░░░░░╚═╝╚═════╝░

//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//*
//  * @project_name : MANU-MD
//  * @author : Manul Official
//  * @youtube : https://www.youtube.com/@ManulOfficialTech
//  * @description : Manu-MD ,A Multi-functional whatsapp user bot.
//*
//*
//base by Manul Official
//GitHub: @manulofficial7
//WhatsApp: +94742274855
//want more free bot scripts? subscribe to my youtube channel: https://youtube.com/@ManulOfficialTech
//   * Created By Github: manulofficial7.
//   * Credit To Manul Official
//   * © 2024 MANU-MD-V7.
// ⛥┌┤
// */

function _0xad41(_0x3f1991,_0x18ea22){const _0x2f0e85=_0x2f0e();return _0xad41=function(_0xad41f6,_0x43ce16){_0xad41f6=_0xad41f6-0x6f;let _0x3cf254=_0x2f0e85[_0xad41f6];return _0x3cf254;},_0xad41(_0x3f1991,_0x18ea22);}const _0x3832a9=_0xad41;(function(_0xf115d4,_0x58a36a){const _0x2a6e43=_0xad41,_0x32399d=_0xf115d4();while(!![]){try{const _0xcfc016=-parseInt(_0x2a6e43(0x79))/0x1+parseInt(_0x2a6e43(0x7d))/0x2*(parseInt(_0x2a6e43(0x75))/0x3)+parseInt(_0x2a6e43(0x78))/0x4+parseInt(_0x2a6e43(0x72))/0x5+parseInt(_0x2a6e43(0x76))/0x6+-parseInt(_0x2a6e43(0x74))/0x7+-parseInt(_0x2a6e43(0x71))/0x8;if(_0xcfc016===_0x58a36a)break;else _0x32399d['push'](_0x32399d['shift']());}catch(_0x1c029b){_0x32399d['push'](_0x32399d['shift']());}}}(_0x2f0e,0x9c070));const chalk=require(_0x3832a9(0x77)),color=(_0x24a6f6,_0x9ac17e)=>{const _0x2bfe26=_0x3832a9;return!_0x9ac17e?chalk[_0x2bfe26(0x70)](_0x24a6f6):chalk[_0x2bfe26(0x7e)](_0x9ac17e)(_0x24a6f6);},bgcolor=(_0x2b8824,_0x216b91)=>{const _0x18c51e=_0x3832a9;return!_0x216b91?chalk['\x67\x72\x65\x65\x6e'](_0x2b8824):chalk[_0x18c51e(0x7c)](_0x216b91)(_0x2b8824);},mycolor=(_0x55ec31,_0x1e9dba)=>{const _0x3466a3=_0x3832a9;return!_0x1e9dba?chalk['\x67\x72\x65\x65\x6e\x42\x72\x69\x67\x68\x74'](_0x3466a3(0x6f))+chalk[_0x3466a3(0x7a)](_0x55ec31):chalk[_0x3466a3(0x7b)](_0x3466a3(0x6f))+chalk[_0x3466a3(0x7e)](_0x1e9dba)(_0x55ec31);};module[_0x3832a9(0x73)]={'\x63\x6f\x6c\x6f\x72':color,'\x62\x67\x63\x6f\x6c\x6f\x72':bgcolor,'\x6d\x79\x63\x6f\x6c\x6f\x72':mycolor};function _0x2f0e(){const _0x5721c8=['\x63\x68\x61\x6c\x6b','\x32\x34\x34\x30\x30\x6b\x7a\x73\x6a\x53\x69','\x31\x37\x30\x38\x38\x30\x6e\x50\x58\x64\x4a\x4a','\x6d\x61\x67\x65\x6e\x74\x61\x42\x72\x69\x67\x68\x74','\x67\x72\x65\x65\x6e\x42\x72\x69\x67\x68\x74','\x62\x67\x4b\x65\x79\x77\x6f\x72\x64','\x32\x48\x64\x45\x46\x6c\x4b','\x6b\x65\x79\x77\x6f\x72\x64','\x5b\x20\x42\x4f\x54\x2d\x4d\x44\x20\x5d\x20','\x67\x72\x65\x65\x6e','\x31\x32\x33\x36\x37\x30\x35\x36\x44\x50\x69\x69\x52\x71','\x31\x32\x30\x31\x35\x30\x30\x70\x50\x6e\x76\x50\x41','\x65\x78\x70\x6f\x72\x74\x73','\x31\x39\x36\x37\x33\x38\x35\x4b\x4e\x4c\x43\x46\x4e','\x33\x37\x38\x35\x33\x34\x33\x75\x58\x63\x77\x73\x55','\x36\x37\x37\x32\x33\x34\x34\x76\x78\x50\x4c\x46\x71'];_0x2f0e=function(){return _0x5721c8;};return _0x2f0e();}