//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                    𝗠𝗔𝗡𝗨-𝗠𝗗  𝐁𝐎𝐓                                                 //
//                                                                                                      //
//                                         Ｖ：7.0                                                       //

//███╗░░░███╗░█████╗░███╗░░██╗██╗░░░██╗
//████╗░████║██╔══██╗████╗░██║██║░░░██║
//██╔████╔██║███████║██╔██╗██║██║░░░██║
//██║╚██╔╝██║██╔══██║██║╚████║██║░░░██║
//██║░╚═╝░██║██║░░██║██║░╚███║╚██████╔╝
//╚═╝░░░░░╚═╝╚═╝░░╚═╝╚═╝░░╚══╝░╚═════╝░

//███╗░░░███╗██████╗░
//████╗░████║██╔══██╗
//██╔████╔██║██║░░██║
//██║╚██╔╝██║██║░░██║
//██║░╚═╝░██║██████╔╝
//╚═╝░░░░░╚═╝╚═════╝░

//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//*
//  * @project_name : MANU-MD
//  * @author : Manul Official
//  * @youtube : https://www.youtube.com/@ManulOfficialTech
//  * @description : Manu-MD ,A Multi-functional whatsapp user bot.
//*
//*
//base by Manul Official
//GitHub: @manulofficial7
//WhatsApp: +94742274855
//want more free bot scripts? subscribe to my youtube channel: https://youtube.com/@ManulOfficialTech
//   * Created By Github: manulofficial7.
//   * Credit To Manul Official
//   * © 2024 MANU-MD-V7.
// ⛥┌┤
// */

const _0x39169d=_0x2118;(function(_0x37ff82,_0x208fa9){const _0x1a7443=_0x2118,_0x17d2c4=_0x37ff82();while(!![]){try{const _0x492f3e=-parseInt(_0x1a7443(0x137))/0x1*(-parseInt(_0x1a7443(0x13e))/0x2)+-parseInt(_0x1a7443(0x136))/0x3*(parseInt(_0x1a7443(0x13b))/0x4)+parseInt(_0x1a7443(0x142))/0x5+parseInt(_0x1a7443(0x133))/0x6*(parseInt(_0x1a7443(0x130))/0x7)+-parseInt(_0x1a7443(0x132))/0x8*(-parseInt(_0x1a7443(0x144))/0x9)+parseInt(_0x1a7443(0x148))/0xa*(-parseInt(_0x1a7443(0x139))/0xb)+parseInt(_0x1a7443(0x13d))/0xc*(parseInt(_0x1a7443(0x140))/0xd);if(_0x492f3e===_0x208fa9)break;else _0x17d2c4['push'](_0x17d2c4['shift']());}catch(_0x46a271){_0x17d2c4['push'](_0x17d2c4['shift']());}}}(_0x47d4,0xcbe3d));function _0x2118(_0x37149e,_0x7f090f){const _0x47d4ca=_0x47d4();return _0x2118=function(_0x211865,_0x149b4a){_0x211865=_0x211865-0x127;let _0x56a37c=_0x47d4ca[_0x211865];return _0x56a37c;},_0x2118(_0x37149e,_0x7f090f);}const https=require(_0x39169d(0x129)),http=require(_0x39169d(0x134)),{URL}=require(_0x39169d(0x127)),ufs=(_0xc356,_0x13652d=0x2710,_0x40b3ca=0x5)=>{return new Promise((_0x4d4a65,_0x5c03fe)=>{const _0x30ed50=_0x2118;_0xc356 instanceof URL&&(_0xc356=_0xc356[_0x30ed50(0x141)]());typeof _0xc356!==_0x30ed50(0x147)&&_0x5c03fe(new TypeError(_0x30ed50(0x12f)));typeof _0x13652d!==_0x30ed50(0x13a)&&_0x5c03fe(new TypeError(_0x30ed50(0x128)));typeof _0x40b3ca!=='\x6e\x75\x6d\x62\x65\x72'&&_0x5c03fe(new TypeError(_0x30ed50(0x14a)));_0x40b3ca<0x0&&_0x5c03fe(new Error(_0x30ed50(0x138)));let _0xca81c3=_0xc356[_0x30ed50(0x13c)]('\x68\x74\x74\x70\x73\x3a\x2f\x2f')?https[_0x30ed50(0x12a)](_0xc356,{'\x74\x69\x6d\x65\x6f\x75\x74':_0x13652d}):http['\x67\x65\x74'](_0xc356,{'\x74\x69\x6d\x65\x6f\x75\x74':_0x13652d});_0xca81c3['\x6f\x6e\x63\x65'](_0x30ed50(0x12b),_0x490cd6=>{const _0xec58=_0x30ed50;_0xca81c3[_0xec58(0x149)]();if(_0x490cd6[_0xec58(0x135)]>=0x12c&&_0x490cd6[_0xec58(0x135)]<0x190&&_0x490cd6[_0xec58(0x12c)][_0xec58(0x146)])_0x40b3ca===0x0?_0x5c03fe(new Error('\x54\x6f\x6f\x20\x6d\x61\x6e\x79\x20\x72\x65\x64\x69\x72\x65\x63\x74\x73')):_0x4d4a65(ufs(_0x490cd6[_0xec58(0x12c)][_0xec58(0x146)],_0x13652d,_0x40b3ca-0x1));else{let _0x3c057f=parseInt(_0x490cd6[_0xec58(0x12c)][_0xec58(0x145)]);!isNaN(_0x3c057f)?_0x4d4a65(_0x3c057f):_0x5c03fe(new Error(_0xec58(0x131)));}}),_0xca81c3[_0x30ed50(0x12e)](_0x30ed50(0x12d),_0x4e7f8e=>{const _0x427339=_0x30ed50;_0xca81c3[_0x427339(0x149)](),_0x5c03fe(new Error(_0x4e7f8e));}),_0xca81c3[_0x30ed50(0x12e)](_0x30ed50(0x13f),()=>{const _0x72566e=_0x30ed50;_0xca81c3[_0x72566e(0x149)](),_0x5c03fe(new Error(_0x72566e(0x143)));});});};module['\x65\x78\x70\x6f\x72\x74\x73']=ufs;function _0x47d4(){const _0x6054ab=['\x6e\x75\x6d\x62\x65\x72','\x31\x33\x39\x36\x43\x73\x4d\x47\x77\x4c','\x73\x74\x61\x72\x74\x73\x57\x69\x74\x68','\x33\x36\x79\x61\x45\x74\x72\x74','\x34\x75\x72\x6e\x4e\x57\x58','\x74\x69\x6d\x65\x6f\x75\x74','\x34\x31\x30\x35\x32\x35\x37\x72\x77\x4a\x54\x55\x57','\x74\x6f\x53\x74\x72\x69\x6e\x67','\x31\x35\x39\x31\x39\x38\x30\x67\x6b\x64\x45\x52\x74','\x52\x65\x71\x75\x65\x73\x74\x20\x74\x69\x6d\x65\x64\x20\x6f\x75\x74','\x35\x34\x32\x34\x33\x57\x6e\x56\x64\x62\x54','\x63\x6f\x6e\x74\x65\x6e\x74\x2d\x6c\x65\x6e\x67\x74\x68','\x6c\x6f\x63\x61\x74\x69\x6f\x6e','\x73\x74\x72\x69\x6e\x67','\x31\x30\x7a\x42\x75\x43\x69\x6b','\x64\x65\x73\x74\x72\x6f\x79','\x6d\x61\x78\x52\x65\x64\x69\x72\x65\x63\x74\x73\x20\x6d\x75\x73\x74\x20\x62\x65\x20\x61\x20\x6e\x75\x6d\x62\x65\x72','\x75\x72\x6c','\x74\x69\x6d\x65\x6f\x75\x74\x20\x6d\x75\x73\x74\x20\x62\x65\x20\x61\x20\x6e\x75\x6d\x62\x65\x72','\x68\x74\x74\x70\x73','\x67\x65\x74','\x72\x65\x73\x70\x6f\x6e\x73\x65','\x68\x65\x61\x64\x65\x72\x73','\x65\x72\x72\x6f\x72','\x6f\x6e\x63\x65','\x75\x72\x6c\x20\x6d\x75\x73\x74\x20\x62\x65\x20\x61\x20\x73\x74\x72\x69\x6e\x67\x20\x6f\x72\x20\x69\x6e\x73\x74\x61\x6e\x63\x65\x20\x6f\x66\x20\x55\x52\x4c','\x37\x70\x61\x6d\x48\x68\x44','\x43\x6f\x75\x6c\x64\x6e\x27\x74\x20\x67\x65\x74\x20\x66\x69\x6c\x65\x20\x73\x69\x7a\x65','\x33\x33\x36\x4e\x54\x4c\x52\x77\x4a','\x32\x39\x37\x30\x34\x32\x30\x59\x70\x4d\x6f\x68\x54','\x68\x74\x74\x70','\x73\x74\x61\x74\x75\x73\x43\x6f\x64\x65','\x39\x32\x37\x30\x67\x49\x6e\x42\x6a\x4a','\x31\x30\x31\x36\x31\x34\x65\x42\x66\x59\x4d\x79','\x6d\x61\x78\x52\x65\x64\x69\x72\x65\x63\x74\x73\x20\x6d\x75\x73\x74\x20\x62\x65\x20\x67\x72\x65\x61\x74\x65\x72\x20\x74\x68\x61\x6e\x20\x30','\x33\x33\x34\x30\x31\x37\x32\x76\x68\x63\x65\x77\x66'];_0x47d4=function(){return _0x6054ab;};return _0x47d4();}