//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                    𝗠𝗔𝗡𝗨-𝗠𝗗  𝐁𝐎𝐓                                                 //
//                                                                                                      //
//                                         Ｖ：7.0                                                       //

//███╗░░░███╗░█████╗░███╗░░██╗██╗░░░██╗
//████╗░████║██╔══██╗████╗░██║██║░░░██║
//██╔████╔██║███████║██╔██╗██║██║░░░██║
//██║╚██╔╝██║██╔══██║██║╚████║██║░░░██║
//██║░╚═╝░██║██║░░██║██║░╚███║╚██████╔╝
//╚═╝░░░░░╚═╝╚═╝░░╚═╝╚═╝░░╚══╝░╚═════╝░

//███╗░░░███╗██████╗░
//████╗░████║██╔══██╗
//██╔████╔██║██║░░██║
//██║╚██╔╝██║██║░░██║
//██║░╚═╝░██║██████╔╝
//╚═╝░░░░░╚═╝╚═════╝░

//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//*
//  * @project_name : MANU-MD
//  * @author : Manul Official
//  * @youtube : https://www.youtube.com/@ManulOfficialTech
//  * @description : Manu-MD ,A Multi-functional whatsapp user bot.
//*
//*
//base by Manul Official
//GitHub: @manulofficial7
//WhatsApp: +94742274855
//want more free bot scripts? subscribe to my youtube channel: https://youtube.com/@ManulOfficialTech
//   * Created By Github: manulofficial7.
//   * Credit To Manul Official
//   * © 2024 MANU-MD-V7.
// ⛥┌┤
// */

function _0x3d95(_0x130b65,_0x552d55){const _0x4cc3fe=_0x4cc3();return _0x3d95=function(_0x3d9595,_0x4fa7e3){_0x3d9595=_0x3d9595-0x1f3;let _0x598f17=_0x4cc3fe[_0x3d9595];return _0x598f17;},_0x3d95(_0x130b65,_0x552d55);}const _0x1aa1cf=_0x3d95;(function(_0x4e941f,_0x4a4967){const _0x52c94d=_0x3d95,_0x5db91c=_0x4e941f();while(!![]){try{const _0x408793=parseInt(_0x52c94d(0x1fa))/0x1+parseInt(_0x52c94d(0x1fd))/0x2*(parseInt(_0x52c94d(0x1f7))/0x3)+-parseInt(_0x52c94d(0x1ff))/0x4+-parseInt(_0x52c94d(0x1fe))/0x5*(parseInt(_0x52c94d(0x1f6))/0x6)+-parseInt(_0x52c94d(0x1fb))/0x7*(parseInt(_0x52c94d(0x200))/0x8)+parseInt(_0x52c94d(0x203))/0x9+parseInt(_0x52c94d(0x1fc))/0xa;if(_0x408793===_0x4a4967)break;else _0x5db91c['push'](_0x5db91c['shift']());}catch(_0x380ff4){_0x5db91c['push'](_0x5db91c['shift']());}}}(_0x4cc3,0x84ef4));function _0x4cc3(){const _0x2ab948=['\x38\x34\x63\x48\x67\x55\x79\x51','\x38\x35\x53\x7a\x79\x75\x64\x6d','\x32\x31\x37\x31\x31\x39\x36\x73\x79\x69\x6d\x42\x4b','\x31\x30\x36\x37\x32\x38\x4e\x54\x47\x69\x65\x49','\x69\x6d\x67\x75\x72','\x75\x70\x6c\x6f\x61\x64','\x38\x33\x30\x37\x33\x35\x31\x64\x46\x47\x77\x71\x56','\x65\x72\x72\x6f\x72','\x64\x61\x74\x61','\x65\x78\x70\x6f\x72\x74\x73','\x31\x36\x36\x39\x35\x36\x54\x6b\x5a\x7a\x61\x4e','\x38\x33\x38\x32\x45\x55\x44\x6e\x76\x68','\x73\x74\x72\x65\x61\x6d','\x63\x72\x65\x61\x74\x65\x52\x65\x61\x64\x53\x74\x72\x65\x61\x6d','\x39\x39\x32\x31\x31\x30\x58\x50\x50\x68\x51\x4b','\x33\x38\x35\x4c\x67\x47\x45\x41\x65','\x32\x36\x31\x35\x39\x39\x30\x6a\x73\x4b\x6b\x6a\x44'];_0x4cc3=function(){return _0x2ab948;};return _0x4cc3();}const pkg=require(_0x1aa1cf(0x201)),fs=require('\x66\x73'),{ImgurClient}=pkg,client=new ImgurClient({'\x63\x6c\x69\x65\x6e\x74\x49\x64':'\x61\x30\x31\x31\x33\x33\x35\x34\x39\x32\x36\x30\x31\x35\x61'});async function uploadtoimgur(_0x4b94ba){const _0x3e6766=_0x1aa1cf;try{const _0xed6bec=await client[_0x3e6766(0x202)]({'\x69\x6d\x61\x67\x65':fs[_0x3e6766(0x1f9)](_0x4b94ba),'\x74\x79\x70\x65':_0x3e6766(0x1f8)});let _0x5ca430=_0xed6bec[_0x3e6766(0x1f4)]['\x6c\x69\x6e\x6b'];return console['\x6c\x6f\x67'](_0x5ca430),_0x5ca430;}catch(_0x392c97){console[_0x3e6766(0x1f3)]('\x45\x72\x72\x6f\x72\x20\x75\x70\x6c\x6f\x61\x64\x69\x6e\x67\x20\x69\x6d\x61\x67\x65\x20\x74\x6f\x20\x49\x6d\x67\x75\x72\x3a',_0x392c97);throw _0x392c97;}}module[_0x1aa1cf(0x1f5)]={'\x75\x70\x6c\x6f\x61\x64\x74\x6f\x69\x6d\x67\x75\x72':uploadtoimgur};