//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                    𝗠𝗔𝗡𝗨-𝗠𝗗  𝐁𝐎𝐓                                                 //
//                                                                                                      //
//                                         Ｖ：7.0                                                       //

//███╗░░░███╗░█████╗░███╗░░██╗██╗░░░██╗
//████╗░████║██╔══██╗████╗░██║██║░░░██║
//██╔████╔██║███████║██╔██╗██║██║░░░██║
//██║╚██╔╝██║██╔══██║██║╚████║██║░░░██║
//██║░╚═╝░██║██║░░██║██║░╚███║╚██████╔╝
//╚═╝░░░░░╚═╝╚═╝░░╚═╝╚═╝░░╚══╝░╚═════╝░

//███╗░░░███╗██████╗░
//████╗░████║██╔══██╗
//██╔████╔██║██║░░██║
//██║╚██╔╝██║██║░░██║
//██║░╚═╝░██║██████╔╝
//╚═╝░░░░░╚═╝╚═════╝░

//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//*
//  * @project_name : MANU-MD
//  * @author : Manul Official
//  * @youtube : https://www.youtube.com/@ManulOfficialTech
//  * @description : Manu-MD ,A Multi-functional whatsapp user bot.
//*
//*
//base by Manul Official
//GitHub: @manulofficial7
//WhatsApp: +94742274855
//want more free bot scripts? subscribe to my youtube channel: https://youtube.com/@ManulOfficialTech
//   * Created By Github: manulofficial7.
//   * Credit To Manul Official
//   * © 2024 MANU-MD-V7.
// ⛥┌┤
// */

const _0x18fe1d=_0x5bb3;function _0x5bb3(_0x4f86a5,_0x42f736){const _0x301227=_0x3012();return _0x5bb3=function(_0x5bb355,_0x3e00ac){_0x5bb355=_0x5bb355-0x83;let _0x40d0ee=_0x301227[_0x5bb355];return _0x40d0ee;},_0x5bb3(_0x4f86a5,_0x42f736);}(function(_0x378a50,_0x1cad47){const _0x3792f6=_0x5bb3,_0x13a904=_0x378a50();while(!![]){try{const _0xa8716e=-parseInt(_0x3792f6(0x92))/0x1+-parseInt(_0x3792f6(0x8d))/0x2+-parseInt(_0x3792f6(0x8b))/0x3*(parseInt(_0x3792f6(0x9f))/0x4)+parseInt(_0x3792f6(0x9a))/0x5+parseInt(_0x3792f6(0x98))/0x6*(-parseInt(_0x3792f6(0x87))/0x7)+parseInt(_0x3792f6(0x85))/0x8+parseInt(_0x3792f6(0x83))/0x9;if(_0xa8716e===_0x1cad47)break;else _0x13a904['push'](_0x13a904['shift']());}catch(_0x79fdfb){_0x13a904['push'](_0x13a904['shift']());}}}(_0x3012,0xb34ee));const https=require(_0x18fe1d(0x94)),http=require(_0x18fe1d(0x84)),{URL}=require(_0x18fe1d(0x8a)),ufs=(_0x5c6554,_0x277247=0x2710,_0x31daf2=0x5)=>{return new Promise((_0x2ea60a,_0x4d3ef0)=>{const _0xba3e33=_0x5bb3;_0x5c6554 instanceof URL&&(_0x5c6554=_0x5c6554[_0xba3e33(0x99)]());typeof _0x5c6554!==_0xba3e33(0x91)&&_0x4d3ef0(new TypeError(_0xba3e33(0x89)));typeof _0x277247!==_0xba3e33(0x96)&&_0x4d3ef0(new TypeError(_0xba3e33(0x95)));typeof _0x31daf2!==_0xba3e33(0x96)&&_0x4d3ef0(new TypeError(_0xba3e33(0x90)));_0x31daf2<0x0&&_0x4d3ef0(new Error(_0xba3e33(0x88)));let _0x2e95f8=_0x5c6554['\x73\x74\x61\x72\x74\x73\x57\x69\x74\x68'](_0xba3e33(0x8c))?https[_0xba3e33(0x8f)](_0x5c6554,{'\x74\x69\x6d\x65\x6f\x75\x74':_0x277247}):http[_0xba3e33(0x8f)](_0x5c6554,{'\x74\x69\x6d\x65\x6f\x75\x74':_0x277247});_0x2e95f8['\x6f\x6e\x63\x65']('\x72\x65\x73\x70\x6f\x6e\x73\x65',_0x17ac39=>{const _0x3ecaef=_0xba3e33;_0x2e95f8['\x64\x65\x73\x74\x72\x6f\x79']();if(_0x17ac39[_0x3ecaef(0x9d)]>=0x12c&&_0x17ac39[_0x3ecaef(0x9d)]<0x190&&_0x17ac39[_0x3ecaef(0x9c)][_0x3ecaef(0x8e)])_0x31daf2===0x0?_0x4d3ef0(new Error('\x54\x6f\x6f\x20\x6d\x61\x6e\x79\x20\x72\x65\x64\x69\x72\x65\x63\x74\x73')):_0x2ea60a(ufs(_0x17ac39[_0x3ecaef(0x9c)][_0x3ecaef(0x8e)],_0x277247,_0x31daf2-0x1));else{let _0x22f787=parseInt(_0x17ac39[_0x3ecaef(0x9c)][_0x3ecaef(0x97)]);!isNaN(_0x22f787)?_0x2ea60a(_0x22f787):_0x4d3ef0(new Error('\x43\x6f\x75\x6c\x64\x6e\x27\x74\x20\x67\x65\x74\x20\x66\x69\x6c\x65\x20\x73\x69\x7a\x65'));}}),_0x2e95f8[_0xba3e33(0x86)](_0xba3e33(0x93),_0x411e13=>{_0x2e95f8['\x64\x65\x73\x74\x72\x6f\x79'](),_0x4d3ef0(new Error(_0x411e13));}),_0x2e95f8[_0xba3e33(0x86)]('\x74\x69\x6d\x65\x6f\x75\x74',()=>{const _0x3ea6ec=_0xba3e33;_0x2e95f8[_0x3ea6ec(0x9e)](),_0x4d3ef0(new Error('\x52\x65\x71\x75\x65\x73\x74\x20\x74\x69\x6d\x65\x64\x20\x6f\x75\x74'));});});};module[_0x18fe1d(0x9b)]=ufs;function _0x3012(){const _0x13b35c=['\x67\x65\x74','\x6d\x61\x78\x52\x65\x64\x69\x72\x65\x63\x74\x73\x20\x6d\x75\x73\x74\x20\x62\x65\x20\x61\x20\x6e\x75\x6d\x62\x65\x72','\x73\x74\x72\x69\x6e\x67','\x33\x33\x34\x36\x33\x64\x4b\x48\x52\x57\x77','\x65\x72\x72\x6f\x72','\x68\x74\x74\x70\x73','\x74\x69\x6d\x65\x6f\x75\x74\x20\x6d\x75\x73\x74\x20\x62\x65\x20\x61\x20\x6e\x75\x6d\x62\x65\x72','\x6e\x75\x6d\x62\x65\x72','\x63\x6f\x6e\x74\x65\x6e\x74\x2d\x6c\x65\x6e\x67\x74\x68','\x33\x30\x71\x4b\x66\x67\x4c\x73','\x74\x6f\x53\x74\x72\x69\x6e\x67','\x32\x39\x31\x33\x39\x39\x35\x53\x6e\x5a\x74\x42\x57','\x65\x78\x70\x6f\x72\x74\x73','\x68\x65\x61\x64\x65\x72\x73','\x73\x74\x61\x74\x75\x73\x43\x6f\x64\x65','\x64\x65\x73\x74\x72\x6f\x79','\x35\x36\x48\x71\x69\x61\x4c\x6f','\x38\x33\x31\x35\x39\x30\x31\x6c\x71\x41\x45\x4f\x62','\x68\x74\x74\x70','\x34\x38\x34\x38\x32\x30\x30\x5a\x6f\x44\x46\x53\x62','\x6f\x6e\x63\x65','\x34\x37\x37\x32\x35\x33\x43\x62\x43\x78\x52\x4e','\x6d\x61\x78\x52\x65\x64\x69\x72\x65\x63\x74\x73\x20\x6d\x75\x73\x74\x20\x62\x65\x20\x67\x72\x65\x61\x74\x65\x72\x20\x74\x68\x61\x6e\x20\x30','\x75\x72\x6c\x20\x6d\x75\x73\x74\x20\x62\x65\x20\x61\x20\x73\x74\x72\x69\x6e\x67\x20\x6f\x72\x20\x69\x6e\x73\x74\x61\x6e\x63\x65\x20\x6f\x66\x20\x55\x52\x4c','\x75\x72\x6c','\x35\x36\x38\x35\x39\x42\x4a\x4e\x4d\x6d\x45','\x68\x74\x74\x70\x73\x3a\x2f\x2f','\x31\x34\x37\x37\x33\x33\x34\x64\x72\x4c\x72\x72\x45','\x6c\x6f\x63\x61\x74\x69\x6f\x6e'];_0x3012=function(){return _0x13b35c;};return _0x3012();}